Autodesk.Revit.DB.NumberingParameter.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.NumberingParameter.NumberingParameterType
The type for numbering parameter association.
Since:
2027

Autodesk.Revit.DB.NumberingParameter.ParameterId
The id of the parameter.
Since:
2027

Autodesk.Revit.DB.NumberingParameter.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.NumberingParameterType)
Create a new parameter with association based on a parameter id and an association type.
parameterId:
The parameter id for the target parameter.
numberingParameterType:
The target for the associated parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The enum is invalid for NumberingParameterType.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.NumberingParameter
Defines a parameter and its source based on associations.
Since:
2027